namespace AvaloniaTemplate.Models.Enums.MessageTypes
{
    public enum MessageBoxResultType
    {
        //
        // Сводка:
        //     Окно сообщения не возвращает никакого результата
        None = 0,
        //
        // Сводка:
        //     Результатом сообщения является значение «OK»
        OK = 1,
        //
        // Сводка:
        //     Результатом сообщения станет значение «Отмена»
        Cancel = 2,
        //
        // Сводка:
        //     Результатом сообщения является значение «Да»
        Yes = 6,
        //
        // Сводка:
        //     Результатом сообщения является значение «Нет»
        No = 7
    }
}
